-- +goose Up
-- +goose StatementBegin
INSERT INTO sizes(size, label)
VALUES
  ('XS', 'فوقي'),
  ('S', 'فوقي'),
  ('M', 'فوقي'),
  ('L', 'فوقي'),
  ('XL', 'فوقي'),
  ('2XL', 'فوقي'),
  ('3XL', 'فوقي'),
  ('4XL', 'فوقي'),
  ('5XL', 'فوقي'),
  ('30', 'سفلي'),
  ('32', 'سفلي'),
  ('34', 'سفلي'),
  ('36', 'سفلي'),
  ('38', 'سفلي'),
  ('40', 'سفلي'),
  ('42', 'سفلي'),
  ('44', 'سفلي'),
  ('46', 'سفلي'),
  ('48', 'سفلي'),
  ('50', 'سفلي'),
  ('36', 'حذاء'),
  ('37', 'حذاء'),
  ('38', 'حذاء'),
  ('39', 'حذاء'),
  ('40', 'حذاء'),
  ('41', 'حذاء'),
  ('42', 'حذاء'),
  ('43', 'حذاء'),
  ('44', 'حذاء'),
  ('45', 'حذاء'),
  ('46', 'حذاء'),
  ('47', 'حذاء')


-- +goose StatementEnd

-- +goose Down
-- +goose StatementBegin
DELETE FROM sizes
WHERE label in ('حذاء', 'سفلي', 'فوقي')
-- +goose StatementEnd
