-- +goose Up
-- +goose StatementBegin
INSERT INTO cities (city) VALUES
    ('بغداد'),
    ('نينوى'),
    ('البصرة'),
    ('الأنبار'),
    ('ذي قار'),
    ('السليمانية'),
    ('أربيل'),
    ('ديالى'),
    ('كركوك'),
    ('النجف'),
    ('كربلاء'),
    ('بابل'),
    ('واسط'),
    ('المثنى'),
    ('ميسان'),
    ('القادسية'),
    ('صلاح الدين'),
    ('دهوك');
-- +goose StatementEnd

-- +goose Down
-- +goose StatementBegin
DELETE FROM cities
WHERE city IN (
    'بغداد',
    'نينوى',
    'البصرة',
    'الأنبار',
    'ذي قار',
    'السليمانية',
    'أربيل',
    'ديالى',
    'كركوك',
    'النجف',
    'كربلاء',
    'بابل',
    'واسط',
    'المثنى',
    'ميسان',
    'القادسية',
    'صلاح الدين',
    'دهوك'
);
-- +goose StatementEnd
